app/views/home/index.html.erb

                    <div class="text">Applicants</div>
                    <div class="number"><%= AcademicYear.current.blank? ? 0 : AcademicYear.current.applicants.count  %></div>
---
SELECT  `academic_years`.* FROM `academic_years` WHERE (status = TRUE) ORDER BY `academic_years`.`id` ASC LIMIT 1
SELECT  `applicants`.* FROM `applicants` WHERE (user_id = 2 and academic_year_id = NULL) ORDER BY `applicants`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `applicants` WHERE `applicants`.`academic_year_id` = 1

                    <div class="text">Programs</div>
                    <div class="number"><%= Program.count %></div>
---
SELECT COUNT(*) FROM `programs`
SELECT `programs`.* FROM `programs`

                    <div class="text">Universities</div>
                    <div class="number"><%= University.count %></div>
---
SELECT COUNT(*) FROM `universities`