app/views/settings/index.html.erb

SELECT  1 AS one FROM `settings` WHERE `settings`.`class` = 'btn-primary' LIMIT 1
SELECT `settings`.* FROM `settings`
---
    <hr/>
<%= link_to 'New Setting', new_setting_path, class: 'btn btn-primary' unless Setting.exists? %>