app/controllers/academic_years_controller.rb

  def index
    @academic_years = AcademicYear.all
---
SELECT  `academic_years`.* FROM `academic_years` WHERE (status = TRUE) ORDER BY `academic_years`.`id` ASC LIMIT 1

  def create
    @academic_year = AcademicYear.new(academic_year_params)

    respond_to do |format|
      if @academic_year.save
---
INSERT INTO `academic_years` (`name`, `status`, `created_at`, `updated_at`) VALUES ('219 Second Term ', FALSE, '2019-03-14 13:36:44', '2019-03-14 13:36:44')

    def set_academic_year
      @academic_year = AcademicYear.find(params[:id])
---
SELECT  `academic_years`.* FROM `academic_years` WHERE (status = TRUE) ORDER BY `academic_years`.`id` ASC LIMIT 1