app/controllers/applicants_controller.rb

  def load_other_university
    university  = University.find_by(id: params[:university])
---
SELECT  `universities`.* FROM `universities` WHERE `universities`.`id` = 3 LIMIT 1

  def submit
    @applicant.update(status: true)
---
UPDATE `applicants` SET `status` = TRUE, `updated_at` = '2019-03-12 12:49:50' WHERE `applicants`.`id` = 1

  def create
    @applicant = Applicant.new(applicant_params)
    @applicant_type = @applicant.applicant_type
    respond_to do |format|
      if @applicant.save
---
INSERT INTO `applicants` (`user_id`, `title`, `first_name`, `father_name`, `grand_father_name`, `gender`, `date_of_birth`, `place_of_birth`, `marital_status`, `nationality`, `region_id`, `city`, `street`, `pobox`, `phone`, `university_id`, `qualification`, `date_of_completion`, `program_id`, `applicant_type_id`, `exam_type_id`, `do_you_have_needs_for_disability`, `disability`, `accomodation_request`, `i_understand`, `i_give_my_permission`, `created_at`, `updated_at`, `academic_year_id`) VALUES (3, 'Dr', 'asdf', 'asdf', 'asdf', 'Male', '2019-02-08', 'me', 'Married', 'e', 2, 'addis ', 'tigrai', '87', '23', 3, 'int', '2019-02-08', 1, 2, 1, TRUE, 'Pregnant', 'hotel', TRUE, TRUE, '2019-02-08 14:37:05', '2019-02-08 14:37:05', 1)

    def set_applicant
      @applicant = Applicant.find(params[:id])
---
SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 4 LIMIT 1