app/controllers/application_instructions_controller.rb

SELECT  `application_instructions`.* FROM `application_instructions` ORDER BY `application_instructions`.`id` ASC LIMIT 1
---
  def index
    @application_instruction = ApplicationInstruction.first

INSERT INTO `application_instructions` (`content`, `created_at`, `updated_at`) VALUES ('Please fill free to <br>', '2019-02-05 14:52:31', '2019-02-05 14:52:31')
---
  def create
    @application_instruction = ApplicationInstruction.new(application_instruction_params)

    respond_to do |format|
      if @application_instruction.save

UPDATE `application_instructions` SET `content` = '<div>This is a step by step application instruction<br></div>', `updated_at` = '2019-02-08 07:08:12' WHERE `application_instructions`.`id` = 1
---
  def update
    respond_to do |format|
      if @application_instruction.update(application_instruction_params)

SELECT  `application_instructions`.* FROM `application_instructions` WHERE `application_instructions`.`id` = 1 LIMIT 1
---
    def set_application_instruction
      @application_instruction = ApplicationInstruction.find(params[:id])