app/controllers/applicant_types_controller.rb

SELECT `applicant_types`.* FROM `applicant_types`
---
  def index
    @applicant_types = ApplicantType.all

INSERT INTO `applicant_types` (`name`, `description`, `created_at`, `updated_at`) VALUES ('International ', '', '2019-01-29 12:21:55', '2019-01-29 12:21:55')
---
  def create
    @applicant_type = ApplicantType.new(applicant_type_params)

    respond_to do |format|
      if @applicant_type.save

SELECT  `applicant_types`.* FROM `applicant_types` WHERE `applicant_types`.`id` = 1 LIMIT 1
---
    def set_applicant_type
      @applicant_type = ApplicantType.find(params[:id])