app/controllers/declarations_controller.rb

SELECT `declarations`.* FROM `declarations`
---
  def index
    @declarations = Declaration.all

INSERT INTO `declarations` (`name`, `created_at`, `updated_at`) VALUES ('I understand that I am registering to take the NHPCA. I certify that the information I have provided on this registration form is true and complete to the best of my knowledge. I agree to abide by all policies concerning the NHPCA.', '2019-01-29 12:29:03', '2019-01-29 12:29:03')
---
  def create
    @declaration = Declaration.new(declaration_params)

    respond_to do |format|
      if @declaration.save