app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT `events`.* FROM `events`

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`academic_year_id`, `name`, `start_time`, `end_time`, `created_at`, `updated_at`) VALUES (1, 'Firs Quarter Application', '2019-02-05', '2019-02-23', '2019-02-06 13:54:54', '2019-02-06 13:54:54')

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE `events` SET `end_time` = '2019-03-20', `updated_at` = '2019-03-12 12:46:31' WHERE `events`.`id` = 1

    def set_event
      @event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1