app/controllers/exam_hubs_controller.rb

  def index
    @exam_hubs = ExamHub.all
---
SELECT `exam_hubs`.* FROM `exam_hubs`

  def create
    @exam_hub = ExamHub.new(exam_hub_params)

    respond_to do |format|
      if @exam_hub.save
---
INSERT INTO `exam_hubs` (`name`, `region_id`, `city`, `created_at`, `updated_at`, `ceiling`) VALUES ('Addis Ababa', 1, 'Addis Ababa', '2019-02-06 14:04:43', '2019-02-06 14:04:43', 200)

  def destroy
    @exam_hub.destroy
---
DELETE FROM `exam_hubs` WHERE `exam_hubs`.`id` = 7

    def set_exam_hub
      @exam_hub = ExamHub.find(params[:id])
---
SELECT  `exam_hubs`.* FROM `exam_hubs` WHERE `exam_hubs`.`id` = 9 LIMIT 1