app/controllers/exams_controller.rb

SELECT `exams`.* FROM `exams`
---
  def import_exam
    if request.post?
      @exams = Exam.import_exam(params[:exam_csv_file])
      flash[:notice] = @exams.blank? ? 'No Exams imported' : 'Exam imported. Check the imported list below'

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def exam_detail
    user = User.find(params[:user])

SELECT `applicants`.* FROM `applicants`
---
  def index
    @applicants = Applicant.all