app/controllers/exam_types_controller.rb

SELECT `exam_types`.* FROM `exam_types`
---
  def index
    @exam_types = ExamType.all

INSERT INTO `exam_types` (`name`, `description`, `created_at`, `updated_at`) VALUES ('OSCE', '', '2019-01-31 11:58:11', '2019-01-31 11:58:11')
---
  def create
    @exam_type = ExamType.new(exam_type_params)

    respond_to do |format|
      if @exam_type.save

UPDATE `exam_types` SET `name` = 'Internal Medicine', `updated_at` = '2019-02-08 13:43:40' WHERE `exam_types`.`id` = 2
---
  def update
    respond_to do |format|
      if @exam_type.update(exam_type_params)

SELECT  `exam_types`.* FROM `exam_types` WHERE `exam_types`.`id` = 2 LIMIT 1
---
    def set_exam_type
      @exam_type = ExamType.find(params[:id])