app/controllers/home_controller.rb

  def index
    @academic_year = AcademicYear.current
    @events = @academic_year.blank? ? [] : @academic_year.events
---
SELECT  `academic_years`.* FROM `academic_years` WHERE (status = TRUE) ORDER BY `academic_years`.`id` ASC LIMIT 1
SELECT  `events`.* FROM `events` WHERE `events`.`academic_year_id` = 1 AND (name = 'Application') ORDER BY `events`.`id` ASC LIMIT 1