app/controllers/passing_marks_controller.rb

  def index
    @passing_marks = PassingMark.all
---
SELECT `passing_marks`.* FROM `passing_marks`

  def create
    @passing_mark = PassingMark.new(passing_mark_params)

    respond_to do |format|
      if @passing_mark.save
---
INSERT INTO `passing_marks` (`academic_year_id`, `program_id`, `passing_mark`, `created_at`, `updated_at`) VALUES (1, 1, 50.0, '2019-01-29 12:19:12', '2019-01-29 12:19:12')

    def set_passing_mark
      @passing_mark = PassingMark.find(params[:id])
---
SELECT  `passing_marks`.* FROM `passing_marks` WHERE `passing_marks`.`id` = 1 LIMIT 1