app/controllers/placements_controller.rb

SELECT `placements`.* FROM `placements` INNER JOIN `applicants` ON `applicants`.`id` = `placements`.`applicant_id` WHERE (academic_year_id = NULL) AND (published is null)
---
  def load_applicants
    academic_year = AcademicYear.current
    @applicants = academic_year.applicants.complete.includes(:placement).where(placements: {id: nil})

SELECT  `academic_years`.* FROM `academic_years` WHERE (status = TRUE) ORDER BY `academic_years`.`id` ASC LIMIT 1
---
  def index
    @placements = Placement.joins(:applicant).where('academic_year_id = ?',AcademicYear.current.try(:id))
    @unpublished = @placements.where('published is null')