app/controllers/programs_controller.rb

SELECT `programs`.* FROM `programs`
---
  def index
    @programs = Program.all

INSERT INTO `programs` (`name`, `created_at`, `updated_at`) VALUES ('Internal Medicine', '2019-01-29 06:29:16', '2019-01-29 06:29:16')
---
  def create
    @program = Program.new(program_params)

    respond_to do |format|
      if @program.save

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 1 LIMIT 1
---
    def set_program
      @program = Program.find(params[:id])