app/controllers/regions_controller.rb

SELECT `regions`.* FROM `regions`
---
  def index
    @regions = Region.all

INSERT INTO `regions` (`name`, `created_at`, `updated_at`) VALUES ('Oromia', '2019-02-05 07:08:16', '2019-02-05 07:08:16')
---
  def create
    @region = Region.new(region_params)

    respond_to do |format|
      if @region.save

SELECT  `regions`.* FROM `regions` WHERE `regions`.`id` = 2 LIMIT 1
---
    def set_region
      @region = Region.find(params[:id])