app/controllers/settings_controller.rb

  def index
    @settings = Setting.all
---
SELECT `settings`.* FROM `settings`