app/controllers/timers_controller.rb

SELECT  `timers`.* FROM `timers` ORDER BY `timers`.`id` ASC LIMIT 1
---
  def load_deadline
    d = Timer.first.end_date