app/controllers/universities_controller.rb

  def index
    @universities = University.all
---
SELECT `universities`.* FROM `universities`

  def create
    @university = University.new(university_params)

    respond_to do |format|
      if @university.save
---
INSERT INTO `universities` (`name`, `created_at`, `updated_at`) VALUES ('Phrmacist', '2019-02-05 12:18:28', '2019-02-05 12:18:28')