app/controllers/users_controller.rb

  def update
    @role = user_params[:role]
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `encrypted_password` = '$2a$11$DH1nyK.Jps3Zdy3105VUouHIBz10FYtW7n6tBim9gBVJKCCzbx8pq', `admin` = FALSE, `confirmation_token` = 'iMHTcn9yq3ay6D6ZFZW9', `confirmation_sent_at` = '2019-03-14 13:33:50', `unconfirmed_email` = 'alematgebsdfsru@gmail.com', `updated_at` = '2019-03-14 13:33:50' WHERE `users`.`id` = 3

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1