app/views/application_instructions/index.html.erb

<div class="body table-responsive">
  <% if ApplicationInstruction.exists? %>
---
SELECT  1 AS one FROM `application_instructions` LIMIT 1
SELECT  `application_instructions`.* FROM `application_instructions` ORDER BY `application_instructions`.`id` ASC LIMIT 1