app/views/application_instructions/show.html.erb

SELECT  1 AS one FROM `application_instructions` LIMIT 1
---
<div class="body table-responsive">
  <% if ApplicationInstruction.exists? %>